; DO NOT TRANSLATE COMMENTS!
; 
; This is a language file
; You can translate it into your native language
; To do this, follow instructions:
; - PLEASE make sure FDM hasn't already been translated into your language 
;   You should go to FDM web site (http://freedownloadmanager.org) and 
;   check the list of available languages
;   or e-mail to support@freedownloadmanager.org
; - copy this language file to xxx.lng, where xxx is the reduced name 
;   of your language. For English it is eng
; - translate all strings of xxx.lng into your language
; - send the translated file to support@freedownloadmanager.org 
;
; Translator - Š. Noviczký; stefan.noviczky@gmail.com; 1.6.2012
;

; Specify your language name in English (and in your language), for example:
; Russian (Русский)
Slovak
; converted from windows-1250 to tf-16
;
; Below are the strings to translate:
; DO NOT TRANSLATE OR REMOVE COMMENTS!
Uložiť všetko
Vystrihnúť
Kopírovať
Prilepiť
Ľahký režim
Stredný režim
Ťažký režim
Možnosti preberania
Telef. pripojenie
O programe FDM
Skončiť
Súbor
Upraviť
Zobraziť
Možnosti
Nástroje
Pomocník
Panel nástrojov
Stavový riadok
Sprievodca optimalizáciou
Predvolené možnosti preberania
Všeobecné nastavenie
Telef. pripojenie
Po dokončení zavesiť
Po dokončení vypnúť počítač
Otvoriť okno odporúčaní Pomocníka
Dom. stránka FDM
Odporučiť priateľovi
Odoslať e-mail podpore
Autom. kontrolovať aktualizácie
Skontrolovať aktualizácie
-
-
Prepnúť do režimu
Prenos
Registrácia
Prevzatie
Plánovač
Prieskumník stránok
HTTP//FTP Prieskumník
Správca stránok
Pridať preberanie
Spustiť preberanie
Zastaviť preberanie
Plánovať preberanie
Pridať úlohu
Vlastnosti úlohy
Prevziať vybrané súbory
Zastaviť
Obnoviť
Pridať stránku
Vlastnosti stránky
Skupiny preberaní
Informácie o preberaní
Denník plánovača
Denník Prieskumníka stránok
Bočný panel
Vytvoriť nové preberanie
Odstrániť preberanie
Spustiť súbor
Otvoriť zložku
Spustiť preberanie automaticky
Vlastnosti preberania
Zapnúť úlohu
Vypnúť úlohu
Odstrániť úlohu
Otvoriť nadradenú zložku
Odpojiť
Prevzatie
Nastavenie Prieskumníka stránok
Odstrániť stránku
Dočasná položka
Stránky
Zobraziť hlavné okno
Monitorovanie prehliadača
Monitorovanie schránky
Spustiť všetky preberania
Zastaviť všetky preberania
-
Pokračovať
-
-
-
-
-
Zrušiť
-
-
-
Všetky skupiny
Filtre
Dokončené
Prebieha
Plánované
Zastavené
Ostatné
Vytvoriť novú skupinu
Odstrániť skupinu
Odstrániť všetky preberania
Odstrániť všetky dokončené preberania
Utvoriť zložku skupín
Vlastnosti skupiny
Názov skupiny:
Predvolená zložka:
Prípony súborov (oddelené medzerou):
Predvol. priorita preberania
Veľmi nízka
Nízka
Priemerná
Vysoká
Veľmi vysoká
Zadajte názov skupiny
Chybné zadanie
Skupina s rovnakým názvom už existuje. Zadajte iný názov.
Zadajte názov zložky
Vyberte predvol. zložku skupiny
Sem zadajte názov skupiny
Predvol. zložka na ukladanie preberaní tejto skupiny
Prehľadávať
Prípona súborov pre túto skupinu. Používa sa na autom. detekciu skupiny preberania.
Predvol. priorita preberania pre túto skupinu
Zrušiť zmeny a zavrieť dialóg
Použiť zmeny a zavrieť dialóg
Chyba v skupinách preberania.
Preinštalujte FDM.
Chyba
Nemožno načítať zoznam preberaní. Pravdepodobne je poškodený alebo používaný inou aplikáciou.
Zlyhala inicializácia integrácie Internet Explorera.
Naozaj to chcete?
Odstránia sa všetky skupiny preberaní.
Potvrdenie
Názov súboru
Veľkosť
Prevzaté
Zostávajúci čas
Časti
Rýchlosť
Komentár
Záznam
Priebeh
Čas
Dátum
Informácia
Vyčistiť
Autom. posúvanie
Neznáma chyba siete
Prístup odmietnutý. Neplatné meno použív. alebo heslo.
Prístup odmietnutý. Neplatné heslo.
Úspešné
Nemožno sa pripojiť na server
Súbor sa na serveri nenašiel
Pripojenie na server sa prerušilo
Server neodpovedá
Nemožno rozoznať názov servera
Server nepodporuje pokračovanie preberania. Nezastavujte toto preberanie, inak ho budete musieť spustiť od začiatku.
Vyžaduje sa meno a heslo pre proxy
Pokročilá chyba
Zlá požiadavka. Možno je nesprávna adresa.
Neznáma chyba servera
Pripojenie prerušené
Zlá adresa
Žiadne pripojenie k internetu
Vybraná verzia HTTP nie je týmto serverom podporovaná
Neznáma chyba
Nemožno odstrániť súbor z disku
Dosiahnutý limit pripojení na tento server
Bol dosiahnutý limit pripojení na server
Pauza %d sek.
Časť
Spustené
Dokončené
Preberanie dokončené
Pripája sa...
Pripojenie úspešné
Presmerovanie...
Presmerovanie úspešné. Otváranie novej adresy.
Spúšťa sa preberanie...
Zastavené
Vytvára sa nová časť...
Zrušené
Reštartuje sa preberanie...
Otvára sa súbor na disku...
Názov súboru je príliš dlhý.
Súbor už existuje. Premenovať na
Premenovať na
Výstupný súbor bol odstránený. Nemožno pokračovať.
Súbor už existuje. Prepísať
Súbor už existuje. Pokračovanie preberania.
Súbor už existuje.
Otvorenie súboru na disku zlyhalo
Veľkosť súboru bola na serveri zmenená!
Nastavuje sa nová veľkosť...
Súbor nemožno prepísať.
Súbor bude premenovaný.
Súbor nemožno premenovať späť na pôvodný názov.
Nemožno uložiť skupiny.
Nemožno uložiť preberanie.
Telef. pripojenie
Pripojiť k:
Vytočiť automaticky 
Pripojiť
Vyberte telef. pripojenie
Označte toto políčko, ak chcete nabudúce vytočiť automaticky.
Vytočiť teraz
Nevytáčať a zavrieť tento dialóg
V počítači sa nenašli žiadne telef. pripojenia
Linka je obsadená.
Zlyhanie hardvéru.
Žiadny vytáč. tón.
Vytáčanie
Pokus
Otvára sa port...
Vytáča sa poskytovateľ...
Pripojené k vzdial. počítaču
Overuje sa meno použív. a heslo...
Rýchlosť pripojenia je %d b/s.
Odpojiť
Opakovanie
Vyžaduje sa meno použív. a heslo
Používateľ:
Heslo:
Skupina:
Uložiť do zložky:
Uložiť ako:
Spustiť
Automaticky
Ručne
Plánovať
Priorita preberania
Spresniť
Adresa súboru, ktorý chcete prevziať
Zadajte meno použív.
Zadajte heslo
Označte toto políčko, ak server požaduje autorizáciu
Názov skupiny kam sa preberanie umiestni. Skupiny vám pomôžu organizovať vaše preberanie.
Priečinok na ukladanie preberaní
Nový názov pre prevzatý súbor. Nechajte toto pole prázdne, ak chcete súbor uložiť pod pôvodným názvom.
Krátky popis prevzatia
Toto prevzatie bude spustené automaticky, keď to bude možné.
FDM sa nebude pokúšať spustiť toto prevzatie automaticky
Plánovať toto prevzatie
Konfigurovať plán prevzatia
Priorita prevzatia. Preberanie s vysokou prioritou bude spustené ako prvé. Preberanie s nízkou prioritou bude odložené.
Zobraziť spresňujúce nastavenie tohto preberania
Zadaná adresa je nesprávna. Skontrolujte ju prosím.
Zadajte meno používateľa
Vyberte výstup. zložku
Všeobecné
Všeobecné informácie
Preberanie je aktuálne uložené do súboru:
Názov prevzatého súboru
Adresu tohto preberania nemožno zmeniť.
Toto preberanie prebieha. Nemožno zmeniť názov súboru.
Súbor nemožno premenovať.
Súbor sa nenašiel.
Cesta je neplatná.
Neplatný formát .exe.
Súbor je používaný inou aplikáciou.
Prístup odmietnutý.
Zariadenie nie je pripravené.
Disk je plný.
Názov súboru je neplatný.
Vyžaduje sa prihlásenie.
Pripojenie
Sieť
Chyby
Pauza medzi pokusmi o pripojenie (v sekundách):
Maxim. počet pokusov
Časový limit (v sekundách):
Minim. veľkosť:
Maxim. počet:
Obmedzenie prenosu pre toto preberanie
Limit prenosu
Ignorovať všetky obmedzenia
B
KB
MB
; second. e.g. KB/s
s.
Zadajte hodnotu väčšiu než %d
Vyberte prosím veľkosť
Čas čakania na pripojenie k serveru pri chybe
Označte toto políčko, ak chcete stanoviť limit max. počtu neúspešných pokusov o preberanie
Čas čakania na odpoveď servera
Minim. veľkosť častí. Preberanie nebude rozdelené do častí s najmenšou veľkosťou.
Maxim. počet častí. Preberanie nebude rozdelené do väčšieho počtu častí.
Určite ako maximálne FDM zaberie preberaniu prenos
Ignorovať obmedzenia prenosu a obmedzenie pre max. počet pripojení pre toto preberanie
V tomto poli môžete určiť hodnotu v bytoch (B), kilobytoch (KB) alebo megabytoch (MB).
Protokol
Identifikovať na serveri ako:
Odkazovač:
Použiť HTTP 1.1
Použiť cookies
Použiť pasívny režim
Režim prenosu
Binárny
ASCII pre súbory s príponami:
Určite, ako sa bude identifikovať FDM s HTTP serverom
Tento reťazec bude odoslaný ako pole Odkazovač na HTTP server. Spravidla sa nepožaduje.
Označte toto políčko, ak chcete aby FDM použil HTTP verziu 1.1
Označte toto políčko, ak chcete aby FDM použil cookies
Označte toto políčko, ak chcete aby FDM použil pasívny režim pre FTP servery. Niekedy je to potrebné, ak pracujete s firewallmi.
Použiť binárny režim pre FTP prenosy. Nastavte tento režim, ak preberaný súbor nie je text.
Použiť ASCII režim pre FTP prenosy. Nastavte tento režim, ak preberaný súbor nie je text.
FDM bude používať ASCII režim pri súboroch s určenými príponami. Pri ostatných súboroch bude FDM používať binárny režim.
Proxy
Získať nastavenie proxy
Z Microsoft Internet Explorera
Určiť ručne
Nepoužívať proxy
Nastavenie
Adresa:
Port:
Zadajte adresu proxy
Zadajte port proxy
FDM získa nastavenie proxy z Internet Explorera
Zadajte nastavenie proxy sami
FDM nebude používať proxy
Vyberte typ serverov, pre ktoré chcete určiť proxy
Zadajte adresu proxy, ktorú chcete použiť
Zadajte port proxy. Spravidla je to 3128, 1080 alebo 8080
Označte toto políčko, ak proxy server vyžaduje autorizáciu
Rôzne
Lokálny súbor
Ak už súbor existuje:
Vyhradiť miesto na disku pre preberaný súbor
Doplnková prípona súboru pre nedokončené preberanie:
Internet server
Nereštartovať, ak nie je pokračovanie podporované
Ak bola veľkosť súboru na serveri zmenená:
Zastaviť pri chybe
Opýtať sa
Prepísať
Premenovať
Pokračovať
Reštartovať
Nastaviť
Určite prosím príponu súboru
Tu môžete určiť čo má FDM robiť, ak súbor už na disku existuje
Označte toto políčko, ak chcete vyhradiť miesto na disku pre spustené preberanie
Ak to bude označené, FDM bude pridávať určenú príponu súboru počas jeho preberania. Po dokončení preberania FDM premenuje súbor späť do pôvodného názvu
FDM nebude reštartovať preberanie, ak vzdialený server nepodporuje pokračovanie
Tu môžete určiť, čo má FDM robiť, ak bola na serveri zmenená veľkosť súboru
Označením tohto políčka zastavíte preberanie, ak sa súbor na serveri nenájde
Označením tohto políčka zastavíte preberanie, ak je meno používateľa alebo heslo neplatné
Použitie režimov prenosu
Vyberte režim, ktorý konfigurovať:
Maxim. počet pripojení:
Maxim. počet pripojení na server:
Obmedzenie prenosu:
neobmedzené
Vyberte režim prenosu, ktorý chcete konfigurovať
Označte toto políčko pre stanovenie limitu max. počtu pripojení
Označte toto políčko pre stanovenie limitu max. počtu pripojení na jeden server
Určite maximálny prenos FDM pre preberané súbory
Všetky preberania
Zoznam preberaní
Autom. uložiť každých
min.
Pri odstraňovaní nedokončeného preberania
Autom. odstrániť dokončené preberanie
Neodstraňovať súbor
Odstrániť súbor
FDM ukladá zoznam preberaní automaticky v určenom časovom intervale. To chráni zoznam pred možným pádom systému alebo výpadkom prúdu.
Tu stanovte, čo má FDM robiť so súborom na disku po odstránení nedokončeného preberania.
Označte toto políčko, ak chcete odstrániť preberanie zo zoznamu automaticky po jeho dokončení.
Monitorovanie
Monitor
Schránka
Monitorovať súbory s príponami
Ignorovať súbory s príponami
Alt nemusí byť stlačený
Alt musí byť stlačený
Vyberte prípony
Označte toto políčko, ak chcete aby FDM monitoroval kliknutia v Internet Exploreri
Označte toto políčko, ak chcete aby FDM monitoroval schránku
Monitorovanie súborov len s určenými príponami
Nemonitorovať súbory s určenými príponami
Monitorovať len ak nie je stlačený Alt
Monitorovať len ak j stlačený Alt
Spúšťanie
Načítať po spustení
Spustiť minimalizované
Systém
Minimalizovať do oznamovacej oblasti
Tlačidlo Zatvoriť minimalizuje okno
FDM bude autom. spustený pri štarte Windows
FDM bude po štarte minimalizovaný
Pri kliknutí na tlačidlo Minimalizovať bude FDM minimalizovaný do lišty
Ak je označené, kliknutie na tlačidlo Zatvoriť bude rovnaké ako na tlačidlo Minimalizovať
Aktualizácia
Adresa aktualiz. servera
FDM bude autom. kontrolovať novú verziu
Sprievodca optimalizáciou využitia siete
Vitajte v Sprievodcovi optimalizáciou využitia siete!
Tento Sprievodca vám pomôže s optimálnym nastavením vášho typu pripojenia. Nastaví vlastnosti preberania a predvolené vlastnosti preberania.
Vyberte typ pripojenia
Skončiť
Vyberte typ pripojenia k internetu
Nakonfigurujte FDM na optimálnu prácu s vašim pripojením
Úloha
Čas spustenia
Čas ďalšieho spustenia
Čas posled. spustenia
Nemožno načítať zoznam plánov. Pravdepodobne bol poškodený alebo je používaný inou aplikáciou.
Nemožno načítať záznam Plánovača.
Nemožno uložiť zoznam plánov.
Úloha "%s" bola naplánovaná. Spustiť ju?
Zmena režimu prenosu na "%s"
Zavesiť
Všetky pripojenia
Zmeniť režim prenosu na
Vypnúť
Reštartovať
Odhlásiť
Raz
Ned
Pon
Uto
Str
Štv
Pia
Sob
V dňoch:
Každé
dni
hod.
Pri spustení FDM
Keď je vytáčanie úspešné
Keď zlyhá vytáčanie
Keď nie sú aktívne preberania
Keď je rýchlosť menšia alebo rovná %d b/s. po dobu %d
Keď sú všetky preberania v stave chyby
Nikdy
Neznáme
Úspešne pripojené k "%s"
Pripojenie k "%s" zlyhalo
Úspešne spustené
Nedostatok pamäte
Nemožno spustiť
Plánované vykonanie bude zapríčinené ukončením programu pri spustení. Plánovač bude ignorovaný.
Maxim. pokusov vytočiť
Pauza medzi pokusmi
Zavesiť, ak je rýchlosť menej ako:
Skúsiť znova
Nie viac než
Použiť pripojenie
Ak úspešne
krát
Zavesiť všetky aktívne pripojenia
Pripojenie, ktoré zavesiť
Názov programu:
Argumenty:
Typ vypnutia:
Potlačiť aplikácie pri ukončení
Spustiť program
Nadviazať telef. pripojenie
Zavesiť pripojenie
Zmeniť režim prenosu
Ukončiť FDM
Vypnúť počítač
Preberanie, ktoré spustiť
Preberanie, ktoré zastaviť
Aplikácie
Všetky súbory
Prepáčte, táto funkcia je dostupná len vo Windows 2000, XP a novšom.
Zadajte názov programu
Vyberte preberanie
Vyberte režim prenosu, ktorý chcete nastaviť pri štarte úlohy
Označte toto políčko, ak chcete určiť max. počet neúspešných pokusov o vytočenie
Čas medzi neúspešnými pokusmi
Označte toto políčko, ak chcete pripojenie nadviazať rýchlosťou nie menšou než je stanovená hodnota
Tu stanovte minimálnu hodnotu požadovanej rýchlosti pripojenia
Ak označíte toto políčko, FDM sa bude pokúšať znova o nadviazanie požadovaného pripojenia
Označte toto políčko pre stanovenie max. počtu neúspešných pokusov o nadviazanie pripojenia
Tu stanovte požadované preberanie
Zoznam všetkých dostupných preberaní
Pridať vybrané preberanie do zoznamu úloh
Odstrániť vybrané preberanie zo zoznamu úloh
Tu špecifikujte program, ktorý spustiť
Nájsť program v počítači
Tu zadajte parametre programu
Tu stanovte typ ukončenia relácie
Označte toto políčko na ukončenie relácie. Obvykle sa používa, ak sú spracovávané aplikácie v systéme. Neuložené údaje budú stratené.
Tu špecifikujte plánované akcie
Označte toto políčko, ak chcete aby FDM zavesil všetky aktívne pripojenia
Tu vyberte, ktoré pripojenie zavesiť
V určitých dňoch
Nedeľa
Pondelok
Utorok
Streda
Štvrtok
Piatok
Sobota
Pri udalosti
Počas
Nízka rýchlosť:
min.
min.
hod.
dni
Keď je rýchlosť preberania príliš nízka
Keď sú všetky preberania v stave chyby
Špecifikujte prosím dni
Spustiť úlohu v stanovenom čase
Tu nastavte čas spustenia úlohy
Spustiť úlohu v zadanom dni
Tu nastavte dátum spustenia úlohy
Spustiť úlohu v určitých dňoch týždňa
Spustiť úlohu každú nedeľu
Spustiť úlohu každý pondelok
Spustiť úlohu každý utorok
Spustiť úlohu každú stredu
Spustiť úlohu každý štvrtok
Spustiť úlohu každý piatok
Spustiť úlohu každú sobotu
Spustiť úlohu periodicky
Toto pole vám umožňuje nastaviť časový interval v minútach, hodinách alebo dňoch.
Spustiť úlohu pri nejakej udalosti
Tu špecifikujte udalosť
Tu zadajte časový interval
Tu zadajte minimálnu požadovanú rýchlosť
Na spustenie úlohy sa požaduje potvrdenie
Čakať na potvrdenie
sek.
Ak je označené, FDM si bude pýtať potvrdenie vykonania tejto úlohy.
Ak je označené, FDM bude čakať stanovený čas na vaše potvrdenie. Ak nebudete v danom čase reagovať, úloha bude spustená.
Adresa:
Zostavenie zoznamu súborov na preberanie
Pripája sa k serveru...
Pokus o použitie mena použív. hesla uložených v Správcovi stránok
Získavanie zoznamu súborov zo servera
Pripojenie na server bolo prerušené. Pokus o obnovenie
Zostavovanie zoznamu
Získať veľkosť a dátum poslednej zmeny súborov
Použitie tohto parametra môže výrazne znížiť rýchlosť.
Označte toto políčko, ak chcete aby FDM zisťoval veľkosť a dátum súborov na HTTP serveroch
Názov stránky
Pripojenia
Prihlásenie
Skupina
Nemožno načítať zoznam stránok. Možno bol poškodený alebo je používaný inou aplikáciou.
Nemožno uložiť zoznam stránok.
Maximum súčasných pripojení:
Predvolená skupina pre nové preberanie z tejto stránky
Použiť pasívny režim FTP
Zadajte názov stránky
Stránka s rovnakým názvom už existuje. Zadajte iný názov stránky.
Max. počet pripojení musí byť väčší než 0
Vyberte prosím skupinu
Tu špecifikujte názov stránky
Označte toto políčko, ak chcete stanoviť maxim. počet súčasných pripojení na tento server.
Označte toto políčko, ak chcete pridať preberanie z tohto servera automaticky do vybranej skupiny.
Opýtať sa
Nepýtať sa ma znova
Chyba pri zápise na disk
Súbor "%s" už na disku existuje. Čo urobiť?
Nepýtať sa na to znova. Vaša voľba bude nastavená ako predvolená.
Prepísať existujúci súbor
Premenovať tento súbor
Pokračovať v preberaní. (Preberanie bude spustené v rovnakom mieste ako je veľkosť existujúceho súboru.)
Zastaviť toto preberanie
Áno
Nie
Preberanie
bolo odstránené. Odstrániť aj súbor na disku?
Zadajte meno používateľa a heslo
Prihlásenie na "%s"
Odoslať určené meno používateľa a heslo na server
Nepripájať sa na tento server
Veľkosť "%s" bola na serveri zmenená. Čo urobiť?
Reštartovať preberanie od začiatku
Nastaviť preberanie na novú veľkosť súboru. Neodporúča sa.
Čakajte prosím
Aktualizácia
Popis
Použitie aktualizácie:
Kontrola aktualizácie
Už používate najnovšiu verziu
Preberanie
Verzia %s vydanie %s e dostupná
Úplná distribúcia verzie %s (%s)
Aktualizovať na verziu %s
Aktualizovať na verziu %s (%s)
FDM by mal byť reštartovaný. Reštartovať teraz?
Aktualizácia dokončená
Nemožno nájsť aktualizátor
Tu špecifikujte typ aktualizácie
Aktualizovať FDM ako celok
Aktualizovať FDM povýšením verzie
Pozrieť ďalšie informácie o procese aktualizácie
Čo je nové v tejto verzii?
Spustiť aktualizáciu FDM
Zrušiť aktualizáciu a zavrieť tento dialóg
Vytvoriť preberanie
Vybrať obsah
Nevybrať obsah
Zoznam preberaní na pridanie
Označením pridajte položky zložky do zoznamu preberania
Zrušením označenia vybraných položiek zložky ich do zoznamu preberania nepridáte
O programe FDM
Copyright (c)
Všetky práva vyhradené
Vlastník registrácie:
Už je aktualizované. Je potrebné reštartovať.
Neplatné meno použív. alebo heslo.
Nemožno načítať súbor histórie.
Nemožno uložiť súbor histórie.
Predvol. nastavenie HTML Spidera
HTML Spider
Štruktúra webstránky
Prevziať webstránku
Nastavenie preberania webstránky
Spustiť preberanie
Zastaviť preberanie
Plánovať preberanie
Odstrániť
Otvoriť webstránku v prehliadači
Spustiť preberanie automaticky
Adresa webstránky
Súbory
Odstrániť aj preberanie?
Nemožno načítať zoznam webstránok.
Nemožno uložiť zoznam webstránok.
Adresa webstránky alebo HTTP servera, ktoré chcete prevziať
Adresa webstránky alebo HTTP server, z ktorých bolo spustené preberanie
Názov zložky, kam uložiť preberanie
Výstup. zložka:
Webstránky
Stránky
Prípony súborov webstránok s HTML kódom:
Prevziať štýly webstránky
Prevziať webstránky z iných stránok
Obrázky
Prevziať obrázky
Prevziať obrázky, ktoré odkazujú na iné stránky
Hĺbka preberania:
Prípony súborov webstránky s HTML kódom. Na webstránkach budú zisťované na preberanie prepojenia na obrázky na iných stránkach.
Ak je označené, budú prevzaté aj štýly webstránky (CSS). Odporúča sa.
Ak nie je označené, stránky z iných webstránok nebudú prevzaté. Ak je napríklad toto políčko neoznačené a začnete preberať z http://priklad.com/, potom nebude prevzaté http://inastranka.com/nieco.html, ale http://priklad.com/nieco.html bude prevzaté.
Ak je označené, budú prevzaté aj obrázky z webstránok.
Ak je neoznačené, obrázky odkazujúce na iné stránky nebudú prevzaté.
Hĺbka preberania. Napríklad spustíte preberanie z http://priklad.com/index.html. Na nej je odkaz na http://priklad.com/nieco.html z http://priklad.com/index.html. Potom hĺbka http://priklad.com/nieco.html bude 1. Nastavenie hĺbky na 0 bude vo výsledku preberanie len úvodnej stránky.
Prevziať súbory z webstránok
Prevziať súbory z ďalších stránok
Odstrániť súbory s príponou
Zapnúť
Prevzatie
Neprevziať
súbory s príponou:
Označte toto políčko, ak chcete z webstránok prevziať súbory
Označte toto políčko, ak chcete prevziať súbory z ďalších stránok
Označte toto políčko, ak chcete ignorovať súbory s danými príponami
Ak je označené, budú prevzaté súbory s príponami špecifikovanými nižšie.
Ak je označené, NEBUDÚ prevzaté súbory s príponami špecifikovanými nižšie.
Export nastavení
Import nastavení
Spustenie Regedit.exe zlyhalo.
Počas pokusu o export nastavení sa vyskytla chyba.
Počas pokusu o import nastavení sa vyskytla chyba.
FDM súbory registra
Vynechanie obrázkov s príponami
obrázkov s príponami
Označte toto políčko, ak chcete ignorovať obrázky so zadanými príponami
Ak je označené, budú prevzaté obrázky s nižšie špecifikovanými príponami
Ak je označené, NEBUDÚ prevzaté obrázky s nižšie špecifikovanými príponami
Nepreberať to a odstrániť
Server nepodporuje pokračovanie preberania. Reštart od začiatku.
Otvorenie adresy zlyhalo.
Prepáčte, počas pokusu o zápis do registra sa vyskytla neočakávaná chyba.
Ďakujeme vám za registráciu! Reštartujte prosím FDM.
Prevziať pomocou FDM
Prevziať webstránku pomocou FDM
Pridať FDM do kontext. ponuky prehliadača
Označte toto políčko, ak chcete do kontext. ponuky Internet Explorera pridať položky "Prevziať pomocou FDM" a "Prevziať webstránku pomocou FDM" (ponuka sa objaví po kliknutí pravým tlačidlom myši).
Znížiť prenos pri aktivite prehliadača
Znížiť o jednu úroveň
Nastaviť režim Ľahký
Označením tohto políčka automaticky znížite prenos pri surfovaní na internete. To vám umožňuje surfovať rýchlejšie počas preberania programom FDM.
Úroveň prenosu bude znížená o jeden stupeň. Silný > Stredný, Stredný > Ľahký
Režim prenosu bude zmenený na Ľahký
Platné pre
Platné pre subdomény
Označte toto políčko, ak chcete použiť tento záznam pre preberanie cez HTTP
Označte toto políčko, ak chcete použiť záznam pre preberanie cez HTTPS
Označte toto políčko, ak chcete použiť záznam pre preberanie cez FTP
Označte toto políčko, ak chcete použiť záznam pre preberanie zo serverov subdomén. Napríklad pre stránku http://site.com to bude http://some.site.com
Vyberte aspoň jeden protokol
Maxim. počet spustených preberaní
Označte toto políčko, ak chcete nastaviť maxim. počet preberaní prebiehajúcich naraz
Reštartovať preberanie
Vytvoriť časť navyše
Zastaviť jednu časť
; context: [section x] - Stopped
Zastavené
; tray menu
Plávajúce okienko
;
Nemožno nájsť zložku Opera Plugin. Chcete ju nájsť ručne?
Nemožno nájsť zložku Netscape Plugin. Chcete ju nájsť ručne?
Nemožno nainštalovať monitorovanie Opery.
Nemožno odinštalovať monitorovanie Opery.
Nemožno nainštalovať monitorovanie Netscape.
Nemožno odinštalovať monitorovanie Netscape.
Označte toto políčko, ak chcete aby FDM sledoval kliknutia v Opere
Označte toto políčko, ak chcete aby FDM sledoval kliknutia v Netscape
; create download dlg
Zistenie veľkosti
; request the size of a download
Požaduje sa...
Zistiť veľkosť preberania zo servera
Áno všetkým
Nie všetkým
Podrobný záznam
Ak je označené, FDM bude zobrazovať odpovede zo servera.
Zmeny sa prejavia po reštarte prehliadača.
Zoznam úloh
Zoznam súborov
Zoznam stránok
Zoznam stránok
Vymazanie preberania
Zostavenie zoznamu preberania
Vytvoriť hromadné preberanie
Od:
Do:
Krok:
Byty zást. znaku:
Výsledky
Vzorka:
Číslo zač. časti
Číslo koneč. časti
Krokovanie sekvencie. Ak je to napríklad 10, potom sekvencia bude 0, 10, 20, ...
Počet bytov zást. znaku. Ak je to napríklad 1, potom sekvencia bude 1, 2, 3. Ak je to 2, potom sekvencia bude 01, 02, 03.
Kliknite sem, ak si chcete pozrieť generovanú sekvenciu
Povoliť Internet Exploreru preberať, ak je stlačené tlačidlo Zrušiť
Označte, ak chcete aby Internet Explorer prevzal súbor, keď stlačíte Zrušiť v dialógu "Vytvoriť prevzatie"
Číslo konečnej sekvencie musí byť väčšie než číslo začiatočnej.
Šablónu adresy stanovíte pomocou (*) v adrese
Vytvoriť príponu, ak ju súbor nemá
Označte toto políčko, ak chcete vytvoriť danú príponu pre súbor, ktorý ju nemá. Ak je napríklad názov súboru "súbor" a vy zadáte "txt", výsledkom bude "súbor.txt"
Zobrazovať veľkosť len v bytoch
Označte toto políčko, ak chcete zobrazovať všetky veľkosti v bytoch namiesto kilobytov, alebo megabytov
Vykonať vírusovú kontrolu
Parametre:
Prípony:
Označte toto políčko, ak chcete automaticky kontrolovať prevzaté súbory na vírusy
Tu špecifikujte názov antivírusového programu
Tu špecifikujte argumenty antivírusového programu
Tu špecifikujte prípony prevzatých súborov, ktoré kontrolovať
Zadajte prosím názov antivírusu
Názov je neplatný. Skontrolujte ho prosím.
Spúšťanie antivírusu
Vypnúť úlohu po vykonaní
Odstrániť úlohu po vykonaní
Označte toto políčko, ak chcete automaticky úlohu vypnúť po jej vykonaní
Označte toto políčko, ak automaticky úlohu vymazať po jej vykonaní
Prejsť
Späť
Generovať názov súboru automaticky
Označte toto políčko, ak chcete generovať názov preberaného súboru automaticky
Uložiť s príponou "htm"
Označte toto políčko, ak chcete ukladať všetky webstránky s príponou "htm"
Kliknite na toto tlačidlo pre výpočet celkovej veľkosti všetkých preberaní
Zachovať štruktúru zložiek podľa servera
Označte, ak chcete zachovať štruktúru zložiek tak ako je na serveri. V opačnom prípade budú všetky súbory uložené v jednej zložke.
Máte vybranú inú zložku. Nastaviť túto zložku ako predvolenú pre túto skupinu? Predvolenú zložku môžete zmeniť aj vo vlastnostiach skupiny.
; === ADDED LINES ===
Preberanie s touto adresou už existuje. Čo chcete urobiť?
Spustiť
Spustiť prevzatý súbor
Verzia
Kliknutím sem sa na nás obráťte
Kliknutím sem prevezmite najnovšiu verziu
Upozornenie. Tento počítačový program je chránený autorským právom a medzinárodnými dohodami. Nepovolené kopírovanie, rozširovanie programu, alebo akejkoľvek jeho časti môže viesť k občianskoprávnym alebo trestnoprávnym postihom v maximálne možnej zákonnej miere.
; === new version ===
Prevziať všetko pomocou FDM
Pridať zoznam preberaní
Odstrániť vybrané
Toto je zoznam adries, ktoré budú pridané
Kliknite na toto tlačidlo, ak chcete odstrániť všetky vybrané adresy zo zoznamu
Nemožno nájsť zložku Firefox Plugin. Chcete ju určiť ručne?
Nemožno nainštalovať monitorovanie Firefoxu.
Nemožno odinštalovať monitorovanie Firefoxu.
Označte toto políčko, ak chcete aby FDM sledoval kliknutia v Mozilla Firefox
Prevziať vybrané pomocou FDM
Spúšťanie
Webstránky
Aktívne preberania
Žiadne preberania teraz nie sú aktívne.
Oznamovanie
Použiť v lište "bubl. tipy"
Časový limit
Označte toto políčko, ak chcete zapnúť oznamovanie v lište "bubl. tipmi", keď je preberanie zastavené, alebo dokončené. Pozn.: funguje len v systéme Windows 2000/XP a novšom.
Autom. zavrieť "bubl. tip" po uplynutí tohto času
Mirrory
Automaticky hľadať adresy mirrorov
Maxim. počet mirrorov
Vypočítať rýchlosť mirrorov
Prepočítať rýchlosť každého
Použite toto tlačidlo, ak chcete aby FDM hľadal adresy mirrorov pre každé preberanie automaticky
Limit počtu adries mirrorov na jedno preberanie. To umožňuje zredukovať čas výpočtu rýchlosti mirrorov
Použite toto tlačidlo, ak chcete aby FDM vypočítal rýchlosť každého mirror servera
Autom. prepočítať rýchlosť každého mirroru počas určeného časového intervalu
Nehľadať, ak je veľkosť súboru menšia než
FDM nebude hľadať mirrory, ak je veľkosť súboru menšia než zadaná
Nehľadať, ak je veľkosť súboru neznáma (odporúča sa)
Pridať mirror
Hľadať mirrory
Pridať adresu mirroru tohto preberania ručne
Hľadať adresu mirroru tohto preberania pomocou FileSearching.COM
Zoznam adries mirrorov
Rýchlosť servera
Používa sa
Odhad rýchlosti mirroru
Odhad rýchlosti mirror serverov
Info o preberaní
Čakanie...
Adresa mirroru preberania
Veľkosť súboru presahuje 2 GB. Takéto preberanie je podporované len cez FTP.
;
;
; #NEW LINES (BUILDS NEWER THAN 195)#
;
;
; BEGIN: New Download page
Nové preberanie
Určiť skupinu preberania automaticky
Nastaviť skupinu na:
Uložiť preberanie do príslušnej zložky skupiny
Označte toto políčko, ak chcete aby bola skupina preberania určená automaticky podľa prípony súboru alebo nastavenia Správcu stránok
Nastaviť predvolenú skupinu ručne
Označte toto políčko, ak chcete preberanie uložiť do predvolenej zložky skupiny (pozrite Vlastnosti skupiny)
Nastaviť predvolenú zložku ručne
; END
; BEGIN: Monitoring page
Monitorovanie na pozadí
Ak je označené, nezobrazuje sa pri pridávaní preberania z prehliadača dialógové okno "Vytvoriť prevzatie"
Prispôsobiť
Výber položiek, ktoré zobraziť v kontext. ponuke Internet Explorera
; END
Výber položiek ponuky, ktoré zobraziť
Musí byť vybraná aspoň jedna položka ponuky
Použiť zvuky
Označte, ak chcete aby FDM pri niektorých udalostiach prehral zvuk (napr. pri dokončení preberania)
Vyberte zvuk pre každú udalosť
; BEGIN : Customize sounds dialog
Prispôsobiť zvuky
Nastaviť zvuk
Odstrániť
Test
Zoznam udalostí FDM a príslušné zvuky. Tu môžete nastaviť aby FDM prehral zvuk, keď sa vyskytne nejaká udalosť
Preberanie pridané – prehrať zvuk, keď bolo pridané jedno alebo viac preberaní do zoznamu
Preberanie dokončené – prehrať zvuk, keď bolo preberanie úspešne dokončené.
Preberanie zlyhalo – prehrať zvuk, keď sa vyskytne chyba počas preberania súboru.
Vytáčanie úspešné – prehrať zvuk, keď bola úspešne vykonaná úloha Plánovača "Nadviazať telef. pripojenie".
Vytáčanie zlyhalo – prehrať zvuk, keď z nejakého dôvodu zlyhala úloha Plánovača "Nadviazať telef. pripojenie".
Nastaviť zvuk pre vybranú udalosť
Neprehrávať zvuk, keď sa vyskytne vybraná udalosť
Test vybraného zvuku
Udalosť
Zvukový súbor
Žiadny zvuk
Preberanie pridané
Preberanie dokončené
Preberanie zlyhalo
Vytáčanie úspešné
Vytáčanie zlyhalo
Zvukové súbory
; END
Hľadanie mirrorov...
Meranie rýchlosti mirrorov...
Hľadanie mirrorov už bolo vykonané
Pripájanie na vyhľadávací server...
Získavanie výsledkov...
Nájdené mirrory: %d
Vyhľadávanie mirrorov dokončené.
Skúša sa ďalší mirror...
Žiadne mirrory sa nenašli.
Zlyhalo
Rýchlosť mirrorov bola zmeraná.
; BEGIN: History page
História
Uložiť históriu prepojení a zložiek
Uložiť len históriu zložiek
Uchovať záznamy za
Maxim. počet záznamov
Vyčistiť históriu
FDM uloží históriu vami zadaných prepojení a zložiek
FDM uloží len históriu zložiek
FDM vymaže záznamy, ktoré sú v históriu dlhšie než je určená doba
Maxim. počet záznamov v histórii. Keď počet záznamov prekročí túto hodnotu, FDM vymaže najstaršie záznamy.
Vymazať z histórie všetky záznamy
; END
Import
Export
Import zoznamu adries
Export zoznamu preberania
Text. súbory
Súbor nemožno otvoriť.
Export všetkých preberaní
Export všetkých preberaní zo zoznamu
Export vybraných preberaní
Neexportovať dokončené preberanie
Pridať, ak už súbor existuje
Neplatný názov skupiny. Nepoužívajte prosím symboly / alebo \.
Ukončiť po dokončení
; BEGIN : Downloads History window
Pridané
Uložené do
; END
Kôš
; BEGIN: Recycle Bin
Vlastnosti
Vyprázdniť Kôš
;END
;BEGIN: Recycle Bin properties
Neumiestňovať odstránené preberania do Koša
Zachovať max.
preberaní
Neuchovávať dokončené preberanie
Pri odstránení preberaní pýtať potvrdenie
Vlastnosti Koša
Označte, ak nechcete ukladať odstránené preberania v Koši
Označte, ak chcete obmedziť počet odstránených preberaní uložených v Koši
Maxim. počet preberaní uložených v Koši
Označte, ak nechcete ukladať dokončené preberania v Koši po ich odstránení
Označte, ak chcete aby FDM pýtal potvrdenie pri pokuse o odstránenie preberania
;END
Obnoviť
Obnovujú sa preberania...
; History subitems
Dnes
Včera
Týždeň
Mesiac
Vlastné...
; end
Vyčistiť históriu
Uložiť históriu preberaní
Uložiť len históriu dokončených preberaní
Označte, ak chcete uložiť históriu preberaní
Označte, ak chcete uložiť len históriu dokončených preberaní
Nastavenie histórie preberaní
Vytváranie zoznamu záznamov histórie...
; Download was deleted
Bolo odstránené
Vyberte časový rozsah
Hľadať
Hľadať ďalej
Hľadať čo
; BEGIN : Find dialog
Hľadať v
Názov lokál. súboru
Tu špecifikujte, čo chcete nájsť
Hľadať v súbore v časti adresy
Hľadať v celej adrese
Hľadať v komentári preberania
Hľadať v názve a ceste prevzatého súboru na lokál. disku
Nastavenie rozšír. hľadania
; ADVANCED settings
Kde hľadať
Hľadať v zozname preberaní
Hľadať v histórii preberaní
Hľadať podľa času
Nastaviť
Hľadať v Koši
Hľadať podľa veľkosti súboru
Minimálne
Maximálne
Hľadať v zozname preberaní
Hľadať v histórii preberaní
Hľadať len preberania v časovom rozsahu
Nastaviť časový rozsah
Hľadať v Koši
Hľadať len súbory v určenom rozsahu veľkosti
Minimálna požadovaná veľkosť
Maximálna požadovaná veľkosť
Hľadať v skupine
Vyberte skupinu, v ktorej bude hľadanie vykonané
; END
Hľadá sa preberanie...
Žiadne položky sa nenašli
Žiadne ďalšie položky sa nenašli
Hľadanie dokončené
Adresa do schránky
Náhľad do ZIP
Mal by byť vybraný aspoň jeden súbor.
Je možné, že súbor, ktorý preberáte, je archív ZIP. Chcete do neho nahliadnuť?
Audio/Video ukážka
Otvorenie súboru zlyhalo.
Neznámy typ média.
Pre túto funkciu prosím nainštalujte DirectX 8.0 alebo novší. Najnovší DirectX si môžete prevziať z microsoft.com.
Info o médiu
Veľkosť:
Dostupné:
Trvanie:
Stlmiť
Prehrať
Pauza
Filter
Prípony (oddelené medzerami, napr. zip rar arj):
Odstrániť súbory s týmito príponami
Ponechať súbory len s týmito príponami
Reťazec neobsahuje makro %file%. Toto makro je potrebné pre indikáciu do vášho antivírusového programu, ktorý kontroluje súbor.
Pokračovať napriek tomu?
Upozornenie
Použiť atribút Skrytý pre nedokončené preberanie
Po dokončení pridať do názvu súboru komentár
Neukladať stránky servera
Označte, ak nechcete do počítača ukladať stránky servera, ale len súbory a obrázky
Použiť náhľad ZIP
Označte, ak si chcete pozrieť obsah archívu ZIP na začiatku preberania len časti archívu.
Jednotka:
Spustiť preberanie automaticky
Označte, ak chcete aby FDM spustil každé nové preberanie automaticky
Označte prosím súbory, ktoré prevziať
Nastavte alternatívne umiestnenia (adresy) pre toto preberanie
Nabudúce neprezerať
Máte vypnutý náhľad ZIP. Ak ho chcete zapnúť, choďte prosím do Možnosti > Možnosti preberania (Ctrl+O) > Nové prevzatie stránky a označte položku "Použiť náhľad ZIP".
Zoznam ignorovaných
Zoznam webstránok, ktoré ignorovať počas preberania stránky.
Podzložky
Pridať
Ignorovať aj všetky podzložky
; Proxy tab new settings
Použiť pri prerušenom preberaní návrat programu
Veľkosť
bytov
Označte túto možnosť, ak chcete zapnúť funkciu návratu programu. Táto voľba vám pomôže ochrániť preberanie pred poškodením.
Veľkosť návratu programu. Väčšie – väčšia bezpečnosť. Odporúčaná veľkosť návratu programu je 3000 bytov. Túto hodnotu môžete zvýšiť, ak sú vaše preberania stále poškodené.
; downloader options -> monitor tab
Nemonitorovať súbory menšie než
Použite túto možnosť, ak chcete aby FDM preskočil súbory menšie než je stanovená veľkosť
KBytov
Pozor! Kôš je príliš veľký. To môže výrazne spomaliť výkon. Odporúča sa vyprázdniť Kôš. Chcete to urobiť?
Nabudúce nekontrolovať
Pozor! História preberaní je príliš veľká. To môže výrazne spomaliť výkon. Odporúča sa vyčistiť Históriu. Chcete to urobiť?
Server nemôže zaručiť schopnosť pokračovania. Odozva je neplatná.
Kopírovať do schránky
; general settings | skins page
Skiny
Skin
Povoliť skinu použiť vlastné ikony
Povoliť skinu použiť vlastné bitmapy
; default skin
<predvolený>
POZNÁMKA: všetky zmeny sa prejavia až po reštarte programu FDM.
Zobraziť informácie o preberaní počas priebehu
Preskočiť súbory s príponou:
Zoznam prípon súborov, ktoré preskočiť
Žiadne aktívne preberanie
Prehrať zvukový súbor po dokončení všetkých preberaní
Importovať zoznam adries zo schránky
Heslá
Možnosti Správcu stránok
; Save password dialog
Uložiť heslo?
Free Download Manager môže uložiť heslo pre tento server, aby ho nebolo potrebné zadávať pri každom preberaní z tohto servera.
Uložiť toto heslo?
Neponúkať žiadne ukladanie hesiel
; Site Manager options | Passwords tab
Použiť Správcu stránok na ukladanie hesiel
Opýtať sa na uloženie hesla
Neponúkať ukladanie hesiel
Pred ukončením odstrániť všetky heslá
Odstrániť všetky heslá
; create new HTML Spider task
Automaticky odstrániť dokončené preberania (odporúčané)
Označte toto políčko, ak chcete automaticky odstraňovať preberania HTML Spidera. Zrýchli to preberanie veľkých stránok.
Zmeny sa prejavia až po reštarte programu Free Download Manager
Nový štýl
Starý štýl
Názov zložky je neplatný
Skryť plávajúce okná v režime na celú obrazovku
Označte toto políčko, ak chcete automaticky skryť plávajúce okná v režime na celú obrazovku.
bolo naplánované na spustenie.
Chcete spustiť?
Spustiť preberanie po dokončení
Pri určení šablóny adresy použite (*), (*A) alebo (*a) v adrese
Vyhľadávací server mirrorov:
Režim spánku
Pohotovostný
Zapamätať si voľbu
Ponúkať zmenu predvolenej zložky skupiny
Uložiť súbor
Otvoriť súbor
Uložiť súbor a otvoriť ho
Typ preberania:
Prepojenie na FDM
Prepojenie na Free Download Manager
Milý používateľ!
Free Download Manager je program poskytnutý zadarmo. Môžete ho používať tak dlho ako chcete.
Ak však uznáte, že je FDM užitočný, pomôžte nám prosím umiestnením prepojenia na neho na svojej webovej stránke. Tak sa viac ľudí dozvie o programe FDM.
Ďakujeme Vám,\ntím vývojárov programu Free Download Manager.
Pripomenúť o 3 dni
Pripomenúť pri ďalšom spustení Free Download Managera
Toto okno nabudúce nezobrazovať
Zobraziť prepojenie v kóde HTML
HTML kód prepojenia
Ďalšie príklady
Kopírovať do schránky
Skryť
; "Traffic usage mode has been changed" window
Režim využitia prenosu bol zmenený
Je prepnutý režim využitia sieťového prenosu.\nFree Download Manager má tri režimy:
V tomto režime Free Download Manager preberá maximálnou možnou rýchlosťou. Toto je najagresívnejší režim.
V tomto režime Free Download Manager preberá priemernou rýchlosťou. Tento režim umožňuje prezerať internet a zachovať vysokú rýchlosť preberania súčasne.
V tomto režime Free Download Manager preberá nízkou rýchlosťou. Tento režim umožňuje preberať bez výrazného spomalenia siete.
;
Pri reštarte premenovať
Zadajte hodnotu nižšiu než %d
; export/import downloads
Súbory zoznamu adries
Súbory s informáciami o preberaní
;
Možnosti exportu
;
Nastaviť dátum súboru identicky s dátumom určeným serverom
Nastaviť dátum prevzatého súboru rovnako ako má na serveri
Vytvoriť súbor popisu
Vytvoriť súbor s názvom "*.dsc.txt" (* – názov prevzatého súboru), ktorý obsahuje krátky popis prevzatého súboru (komentáre + adresa + dátum). Tento súbor bude vytvorený len pre preberanie, ktoré obsahuje komentáre.
Tento súbor bol prevzatý z
Nepreberať dátum súboru zo servera
Táto voľba umožňuje zvýšiť rýchlosť spúšťania preberania z FTP. Free Download Manager použije príkaz SIZE namiesto príkazu LIST.
Neukladať záznamy o preberaní
Povolením tejto možnosti sa bude Download Manager spúšťať a ukončovať rýchlejšie a zníži sa využitie pamäte.
;
Exportovať históriu preberaní
Exportovať všetky položky
Exportovať všetky položky zoznamu
Exportovať vybrané položky
Exportovať len položky dokončených preberaní
;
Súbory HTML
;
História preberaní Free Download Managera
Adresa preberania
Prevzaté do súboru
Veľkosť súboru
Preberanie bolo dokončené
Preberanie bolo odstránené
;
Uložené do
Veľkosť súboru
Podpora pokračovania
Tento dialóg pri dokončení alebo zastavení preberania zavrieť
Otvoriť
Chcete vidieť toto okno aj nabudúce?
Áno, toto okno zobraziť pri každom preberaní
Nie, toto okno už nezobrazovať
Áno, ale nie pri tomto preberaní
Pri použití klávesu Shift bude toto preberanie z disku odstránené a nebudete ho môcť obnoviť.\nNaozaj to chcete?
Vyberte skupinu
Nastaviť koreňovú zložku skupiny
Vyberte koreňovú zložku skupiny.\nZmeny sa prejavia len u nových preberaní.
Naposledy prevzaté súbory
(prázdne)
Obmedziť všetky preberania
Zobraziť okno priebehu preberania
Ak je označené, FDM vytvorí vždy špeciálne okno s informáciami o preberaní
; general settings | misc page
Časové limity na potvrdenie
Spustiť preberanie
Opýtať sa na typ vypnutia
Časový limit potvrdenia príkazu "Nástroje > Zavesiť po dokončení".
Časový limit potvrdenia príkazu "Nástroje > Ukončiť po dokončení".
Časový limit potvrdenia príkazu "Nástroje > Vypnúť počítač po dokončení".
Časový limit potvrdenia na otvorenie prevzatého súboru po dokončení.
Ak je označené, FDM sa opýta na typ vypnutia pri príkaze "Nástroje > Vypnúť počítač po dokončení".
Nepýtať sa na potvrdenie
; 5 seconds, 10 seconds, ...
%d sekúnd
Čakať na potvrdenie
Ignorovať stránky z tejto zložky
Prevziať stránky len z tejto zložky
Vrátane podzložiek
Ignorovať všetky stránky umiestnené v tejto zložke
Prevziať len stránky umiestnené v tejto zložke a ignorovať ostatné webstránky.
Označte túto možnosť, ak chcete aby HTML Spider ignoroval (alebo prevzal len tie) stránky umiestnené vo všetkých podzložkách zadanej zložky.
Musíte zadať adresu zložky.\nPríklad: "http://site.com/docs/".
Typ
Ignorovať
Len
Nastaviť čísla
Priradiť
Musíte nastaviť čísla pre dávkový zoznam.\nPríklad: 1-100 alebo 1-100s2w3.
Kliknutím na toto tlačidlo priraďte skupinu čísiel pomocou dialógového okna.
Jedno číslo
Číslo
Priradiť skupinu čísiel
Chyba syntaxe
Rozbaliť archív
Rozbaliť
Rozbalenie
Cieľová zložka
Rozbalenie zlyhalo. Formát súboru je neznámy.
Prenos údajov prevzatých tento mesiac\n(predchádzajúci mesiac bolo prevzatých: %s)
Celková rýchlosť preberania
Zakázať po vykonaní úlohu Nástroje > ... po dokončení
Ak je táto možnosť vybraná, všetky úlohy z Nástroje > ... po dokončení budú po vykonaní automaticky zakázané. To znamená, že budú spustené iba raz.
; %s
; 1st - file name
; 2nd, 3rd - file info (size + date).
"%s" už existuje.\n\nChcete zmeniť\n(%s)\n\nna\n(%s)?
Áno všetkým
Preskočiť
Preskočiť všetky
Formát archívu je neznámy
Navštíviť webstránku
Inštalovať balík
V predvolenom nastavení FDM podporuje len archívy ZIP, RAR a ARJ.\nZoznam podporovaných archívov možno rozšíriť inštaláciou balíka podpory ďalších archívov pre FDM (nutné pripojenie k internetu).
Balík podpory archívov pre FDM
Nahor
Nadol
Presunúť vybrané preberanie nahor
Presunúť vybrané preberanie nadol
Kontrolovať integritu archívu
Niektoré webstránky poskytujú špeciálne kontrolné súčty súborov dostupných na prevzatie, aby mohli používatelia skontrolovať, či nie je prevzatý súbor poškodený. Sem môžete zadať tento kontrolný súčet a FDM skontrolujte integritu súboru.
Algoritmus
Kontrolný súčet
Prilepiť zo schránky
Skontrolovať
Vypočítava sa kontrolný súčet prevzatého súboru...
Kontrola integrity súboru úspešná
Kontrola integrity súboru zlyhala
Kontrola integrity súboru bola úspešne dokončená.\nV prevzatom súbore sa nenašli žiadne chyby.
Kontrola integrity súboru bola dokončená.\nNašli sa chyby – súbor bol počas preberania poškodený. Je potrebné reštartovať preberanie od začiatku.
Ak bola kontrola úspešná, toto okno už nezobrazovať
Nemožno nájsť spustiteľný súbor vybraného antivírusu.\nVyberte ho sami.
Veľkosti súborov sa nezhodujú
Uložiť ako:\n(príklad: subor(*)(*A)(*a).txt)
Neplatné zadanie uloženia ako šablóny.\nSkontrolujte, či zodpovedá šablóne adresy.
Po dokončení
Po dokončení (všetky dokončené alebo chybné)
Aplikácie
Čo je to?
Názory
;
Ľudia!
Free Download Manager (FDM) je jedným z najobľúbenejších programov na preberanie na svete, má milióny aktívnych používateľov, ale teraz sa stal ešte spoločenskejším!
Ak si myslíte, že je užitočný, pomôžte nám šíriť o ňom informácie umiestnením prepojenia na svoj blog, webovú stránku alebo vo svojom osobnom priestore, napr. na Myspace/MSN.
; %s will be replaced with "FDM buzz" 
Oficiálne bol %s spustený 6.8.2006. Našim cieľom je urobiť z programu FDM najrýchlejšie sa rozširujúcu aplikáciu po Firefoxe!
FDM buzz
; %s will be replaced with "blog" 
Pokrok v programe FDM možno sledovať na našom %s.
blog
Ďakujeme za pomoc,\ntím vývojárov programu Free Download Manager
Toto okno nabudúce nezobrazovať
Zapojiť sa do FDM buzz
Nie, ďakujem
Komunita FDM
Prepnúť po prevzatí na "Názory"
Ak je povolené, po dokončení preberania sa automaticky aktivuje karta "Názory".
Upraviť identifikáciu siete Internet Explorera
Ak je povolené, prehľadávanej webovej stránke bude oznámené, že je nainštalovaný Free Download Manager. Používanie tejto možnosti však môže viesť k zablokovaniu niektorých stránok.
Škodlivé?
Kontrola, či niekto z používateľov programu Free Download Manager oznámil, že toto prevzatie obsahuje vírus, adware, spyware atď.
OK, nikto z používateľov programu Free Download Manager neoznámil, že toto prevzatie je škodlivé.\n\nTo však nezaručuje, že toto prevzatie nie je škodlivé a odporúča sa skontrolovať ho pomocou niektorého antivírusového programu.
; keep all %xxx, \n as is.
%d z %d používateľov programu Free Download Manager oznámili, že toto prevzatie je škodlivé.\nPriemerné hodnotenie tohto prevzatia je %.*g.\n\nZobraziť názory na toto prevzatie?
Kontrolovať škodlivosť každého prevzatia pred preberaním
Pomocou tejto možnosti bude program FDM automaticky pred prevzatím kontrolovať, či používatelia neohlásili jeho škodlivosť.
Zobraziť názory pri preberaní
Ak je povolené, po dokončení preberania program FDM automaticky aktivuje kartu "Názory" a zobrazí názory.
Kontrola, či nie je prevzatie škodlivé (pozrite možnosti zakázania tejto funkcie)
OK, nikto neoznámil škodlivosť
Upozornenie! Niekto oznámil, že toto prevzatie je škodlivé.
Zavrieť
Načíta sa
Nepreberať to
Zapisovať do vyrov. pamäte pri ukladaní údajov na disk
Ak je povolené, program FDM bude používať interný zásobník určenej veľkosti na operácie ukladania preberaných údajov. Tým znižuje počet použití pevného disku. Zvyšuje sa tak rýchlosť preberania pri pripojení s vysokou rýchlosťou.\nPretože však preberané údaje nie sú ihneď ukladané na pevný disk, pri nejakom zlyhaní počítača bude potrebné tieto údaje prevziať znova (podľa určenej veľkosti).\nOdporúča sa pri pripojení s vysokou rýchlosťou.
Nie je možné nainštalovať monitorovanie programu SeaMonkey (Mozilla Suite)
Nie je možné odinštalovať monitorovanie programu SeaMonkey (Mozilla Suite)
Označte toto zaškrtávacie políčko, ak chcete aby program FDM zachytil kliknutia v prehliadači Mozilla Firefox
Označte toto zaškrtávacie políčko, ak chcete aby program FDM zachytil kliknutia v prehliadači SeaMonkey (Mozilla Suite)
Povoliť prehliadaču prevziať, ak je stlačené tlačidlo Zrušiť
Označte toto zaškrtávacie políčko, ak chcete aby prehliadač prevzal súbor, keď stlačíte tlačidlo Zrušiť v dialógovom okne "Vytvoriť prevzatie"
Pridať program FDM do kontext. ponuky prehliadača
Označením zaš. políčka pridáte do kontext. ponuky prehliadača položky "Prevziať pomocou FDM" a "Prevziať webstránku pomocou FDM" (objaví sa po kliknutí pravým tlačidlom myši)
Vyberte položky, ktoré sa majú objaviť v kontext. ponuke prehliadača
Nie je možné nainštalovať monitorovanie programu Firefox
Presunúť súbory do zložky
Rýchlosť je príliš nízka. Reštartuje sa časť...
Reštartovať, ak je rýchlosť príliš nízka po dobu (min.):
Reštartovať časť, ak sa výrazne zníži rýchlosť preberania
Chcete znova zobraziť okno priebehu preberania?
Prepáčte, táto služba teraz nie je k dispozícii. Skúste znova neskôr.
Navrch
Na spodok
Umiestniť navrch zoznamu
Označte túto možnosť, ak chcete umiestniť prevzatie navrch zoznamu.
Monitorovanie v prehliadači Firefox nie je možné povoliť, pretože je nainštalované rozšírenie FlashGot.\nNajprv je potrebné odinštalovať FlashGot.
Povoliť
Zakázať
Prepnúť
Ak je povolený režim "Obmedziť všetky prevzatia", bude zakázané (inak bude povolené).
Oficiálne bude služba %s spustená 16.8.2006. Našim cieľom je, aby bol program FDM najrýchlejšie sa rozširujúcou internetovou aplikáciou po Firefoxe!
Automaticky prevziať a nainštalovať aktualizácie
Len oznámiť dostupnosť aktualizácie
Vypnúť automatické aktualizácie
Monitorovanie je teraz povolené len v programe %s.
Odstrániť záznam
Naozaj odstrániť?
Zápis do zložky programu Free Download Manager nie je možný.\nProgram Free Download Manager potrebuje povolený zápis, aby mohol ukladať súbory, inak budú všetky údaje po reštarte programu FDM stratené.
Toto malé okno umožňuje presúvať prepojenia z prehliadača do programu Free Download Manager.\nDvojitým kliknutím ľavým tlačidlom myši umožňuje aj rýchle zobrazenie alebo skrytie okna programu Free Download Manager.\n\nAk ho chcete skryť, kliknite do okienka pravým tlačidlom myši a zrušte označenie položky "Plávajúce okienko".
Plávajúce okienko programu Free Download Manager
Zakázať všetky oznámenia pri dávkovom preberaní
Označením tejto možnosti zakážete všetky (bublinové aj zvukové) oznámenia pri preberaní vytvorenom príkazom "%s".
Ignorované
Nastavte zoznam prípon súborov a stránok, ktoré nebudú monitorované.
Nezachytávať preberanie z týchto stránok (oddelené medzerami):
FDM nebude monitorovať preberanie zo stránok uvedených v tomto zozname. Zadajte názvy domén (napr. "stranka.com"). Môžete použiť symboly '*'.
Upozornenie!\nPočas vykonávania antivírusovej kontroly došlo k chybe.\nChcete napriek tomu spustiť prevzatý súbor?
Integrita
Vykonávať kontrolu integrity preberaného súboru
Pre kontrolu integrity preberaného súboru musí program Free Download Manager poznať platný kontrolný súčet súboru. Väčšinou ho treba pri každom preberaní zadať.
Ak kontrola zlyhá
Platný kontrolný súčet tohto súboru
Nerobiť nič
Vyberte, čo má program FDM robiť, ak kontrola integrity zlyhá.\nOpýtať sa – FDM sa opýta, čo treba robiť.\nReštartovať – FDM bude opakovať preberanie od začiatku.\nNerobiť nič – FDM pridá záznam o chybe do denníka preberania a nebude robiť nič ďalšie.
Kontroluje sa integrita...
Kontrola integrity úspešná.
Kontrola integrity zlyhala!
Vyberte algoritmus kontroly integrity.
Platný kontrolný súčet
Výsledok kontrolného súčtu
; zip preview window
Označiť všetko/Neoznačiť nič
; group's properties dialog
Makrá
názov servera (napr. "freedownloadmanager.org")
cesta k preberanému súboru na serveri
aktuálny rok
aktuálny mesiac (čísla 1 až 12)
aktuálny deň
; don't translate "%year%-%month%-%day%" here
je "%year%-%month%-%day%"
;
Z Mozilla Firefoxu
FDM prevezme nastavenie proxy z Firefoxu
; new download settings
Použiť túto skupinu
; Downloads -> Schedule ->
Spustiť
Zastaviť
Plán začiatku preberania
Plán zastavenia preberania
;
; downloads that are not completed or have been completed recently
Nedokončené + Posledné
Nadradená skupina
;
; create new download dialog -> set output folder as default dialog
Nastaviť aj ako predvolené pre všetky skupiny preberaní
; %s - place of name of the group. don't change this
Kliknutím na tlačidlo OK nastaviť túto zložku ako predvolenú výstupnú zložku skupiny "%s"?
;
;
Vymazať zoznam prevzatí
Odovzdávanie
Odovzdávanie súborov
Spustiť odovzdávanie
Zastaviť odovzdávanie
Naplánovať odovzdávanie
Presunúť vybrané odovzdávanie nahor
Presunúť vybrané odovzdávanie nadol
Odovzdané
Zoznam odovzdaní
Získava sa cieľová adresa odovzdávania z hlavného servera...
Prerušiť
; outlook express: view | insert file | ...
Ako príloha
Ako prepojenie (odovzdanie)
Priečinok
;
Pridať súbory
Pridať zložku
Bittorrent
Povoliť podporu protokolu Bittorrent
Obmedzenie prenosu odovzdávania
Max. počet pripojení odovzdávania
Použiť porty v rozsahu od
do
Povoliť DHT
Povolenie/zakázanie podpory protokolu Bittorrent. Ak sú však v zozname Koša programu FDM nejaké preberania protokolu Bittorrent, protokol Bittorrent nebude zakázaný úplne.
Obmedzenie maximálnej rýchlosti pripojení odovzdávania. Pri protokole Bittorrent sa neodporúča a môže znížiť rýchlosť preberania.
Celkový maximálny počet pripojení odovzdávania. Príliš nízke číslo môže znížiť rýchlosť preberania.
Zadajte rozsah portov, ktoré program FDM použije pri pripojení odovzdávania.
Povoliť rozšírenie DHT
Meno
Pre tracker je potrebné prihlásenie
Pridať preberanie Bittorrent
Pri prístupe k súboru torrentu došlo k chybe.
Súbor torrentu
Zdá sa, že chcete prevziať súbor .torrent. Je potrebné povoliť v programe FDM podporu protokolu Bittorrent.\n\nChcete povoliť podporu protokolu Bittorrent?
Zadajte heslá znova: zadané heslá sa nezhodujú.
Vyberte súbory, ktoré chcete odovzdať.
Vlastnosti odovzdávania
Zistený informačný súbor Metalink. Pokračuje sa v preberaní.
Zistený informačný súbor Bittorrent. Pokračuje sa v preberaní.
Prístup k súborom na disku sa nepodaril.
Pripája sa k trackeru...
Získanie platnej odpovede z trackera sa nepodarilo.
Odpoveď z trackera bola úspešne prijatá.
Kontrola súčtu časti preberania zlyhala. Preberá sa znova...
Prideliť tomuto preberaniu celé prenosové pásmo
Zakázať automatické načítanie programu Free Download Manager pri spustení systému Windows?
Prepáčte, komunitná služba FDM je práve nedostupná. Skúste znova neskôr.
Názov súboru nesmie obsahovať symboly \ / : * ? " < > |. Zadajte iný názov.
Názov zložky nesmie obsahovať symboly : * ? " < > |. Zadajte iný názov.
Prispôsobiť plávajúce okná
Priehľadnosť
Údaje
Uchovávať všetky súbory v aktuál. použív. zložke
Uchovávať všetky súbory v tejto zložke
Zmeny sa prejavia po reštarte programu Free Download Manager.
Zobraziť okno priebehu preberania
Vytvoriť prenosnú verziu
Prenosná verzia programu Free Download Manager je určená na používanie na iných počítačoch bez toho, aby bolo potrebné program inštalovať a konfigurovať.\n\nMôžete ju umiestniť napríklad na pamäťový flash disk.\n\nPo prvom spustení sa zaregistruje v počítačovom systéme a integruje do prehliadačov. Pri ukončení sa registrácia sama zruší automaticky.\n\nVyberte miesto, kde vytvoriť túto prenosnú verziu. Mala by to byť zložka na nejakej vymeniteľnej jednotke.\n\nNapr. "I:\Moje prenosne programy\".
Integrácia
Priradiť súbory .torrent programu Free Download Manager
Pre nové preberanie vždy použiť túto skupinu
Vždy použiť túto skupinu a pamätať si poslednú výstupnú zložku
Prevzatie flash videa
Prevziať video pomocou FDM
Táto stránka nie je podporovaná. Pozrite zoznam podporovaných stránok.
Pridať na prevzatie
Na tejto stránke je flash video. Preberá sa flash video...
Konvertuje sa...
Konvertovať
Možnosti konverzie
Formát súboru
Veľkosť videa
; video quality
Kvalita
Veľmi nízka
Nízka
Normálna
Priemerná
Vysoká
Veľmi vysoká
;
AVI pomocou MPEG-4 (*.avi)
AVI pomocou XVID (*.avi)
Bez zmeny
Bitová rýchlosť videa
Bitová rýchlosť zvuku
Pamätať si nastavenie ako predvolené
;
Vytvoriť prevzatie flash videa
Automaticky konvertovať prevzaté video do určeného formátu
Nastaviť spresňujúce možnosti
Zobraziť zoznam podporovaných stránok
; used in "create flash video download" window
napr.
Nasledujúci pokus o pripojenie k trackeru o %d s.
Pripravujú sa súbory na disku... Môže to trvať niekoľko minút.
Stav
Pripravujú sa súbory na disku...
MP4 pre iPod/PSP (MPEG4 + AAC, *.mp4)
Ukážka/konverzia média
Konverzia súboru média
Prepnúť na túto kartu automaticky
;keep "\n\n%s\n" as is
Súbor média bol úspešne konvertovaný a uložený v\n\n%s\n.
Konverzia súboru média sa nepodarila\n\n%s.
Skupina pre nové preberanie
Info hash
Peery
Klient
Časti
Tracker
Stav trackera
Rýchlosť odovzdávania
Odovzdané bajty
Hodnotenie zdieľania
Počet zbytočných bajtov
Adresa súboru torrentu
Naozaj to chcete?\nPreberanie bude reštartované od začiatku.
Prenesené údaje ("prevzaté"; "odovzdané") v tomto mesiaci\n(minulý mesiac: %s)
Celková rýchlosť ("preberanie"; "odovzdávanie")
Súbory na odovzdanie
Názov balíka
Komprimovať
Nastaviť heslo pre toto preberanie
Zadajte znova
Ponechať tieto súbory
Predpokladaný počet preberaní
Pridať prepojenie na tieto súbory do nášho katalógu
Zahrnúť rozšírené informácie (všetky polia sú voliteľné)
Popisy
Značky
Meno
E-mail
E-mail príjemcu
Menej než 10
Od 10 do 100
Viac než 100
2 dni
7 dní
1 mesiac
;compression methods
Žiadna
Rýchla
Priemerná
Najlepšia
Nastavenie odovzdávača
Integrovať odovzdávač do
Kontextová ponuka Prieskumníka
Ponuka Prieskumníka "Odoslať kam..."
Použiť jednoduchú ponuku odovzdávania
Minim. veľkosť súboru na odovzdanie
Nastavenie HTTP proxy
Aktivácia odovzdávania
Odovzdávanie vyžaduje aktiváciu. Tým sa chráni náš server pred automatickým odovzdávaním. Zadajte aktivačný kód.
Pripája sa k odovzdávaciemu serveru
Úspešne pripojené k odovzdávaciemu serveru
Súbor bol úspešne odovzdaný na server
Odovzdávanie súboru bolo zastavené
Vytvára sa archív ZIP odovzdávaných súborov...
Archív ZIP sa nepodarilo vytvoriť
Archív ZIP bol úspešne vytvorený
Odosiela sa požiadavka na server...
Odosielajú sa informácie o tomto odovzdaní na server...
Informácie boli odoslané
Odosielanie informácií o tomto odovzdávaní na server sa nepodarilo
Aktivuje sa odovzdávanie...
Odovzdávanie bolo úspešne aktivované
Aktivácia odovzdávania sa nepodarila
Odovzdávaný súbor sa na disku zmenil
Neočakávaná chyba
Počíta sa kontrolný súčet...
; "I agree to terms" string in two lines
Súhlasím
s podmienkami
Musíte súhlasiť s podmienkami.
Kontrola aktualizácií sa nepodarila
K dispozícii je nová verzia. Je potrebná aktualizácia.\nChcete aktualizovať teraz?
Vyžaduje sa aktualizácia programu Free Download Manager
Vyžaduje sa reštart programu Free Download Manager
Odporúčať odovzdávanie príloh
Pripojiť k správe (pomalé)...
Odovzdať a vložiť prepojenie (trochu rýchlejšie)...
Počas spúšťania odovzdávania sa vyskytla chyba. Skontrolujte svoje pripojenie a skúste to znova.
Pripojili ste veľký súbor(y).\nZ viacerých príčin neodporúčame odosielať veľké súbory ako prílohy, ale odovzdať súbory a odoslať prepojenia na ne.\n\nChcete ich odovzdať?
Odporúča sa odovzdanie
Nastavenie integrácie
Odovzdávanie %s bolo dokončené.\nAko prepojenie na prevzatie použite nasledujúcu adresu:
Celková veľkosť
Otvoriť v prehliadači
Na odovzdávanie súborov nemožno ďalej používať súčasnú verziu programu FDM. Je potrebné aktualizovať ho.
Nie je možné ďalej používať súčasnú verziu programu Free Upload Manager. Je potrebné aktualizovať ho. Navštívte stránku freedownloadmanager.org.
Príliš dlhé zadanie.
Nastavenie integrácie správcu odovzdávania
Nastavenie integrácie programu Free Upload Manager
Odovzdať
Preberá sa aktualizácia...
Povoliť fragmentáciu
Predvolene zakázať fragmentáciu
Posúdiť preberanie ako škodlivé, ak ho aspoň
% používateľov takto označí
V poriadku, používatelia programu FDM nehlásili, že je tento preberaný súbor škodlivý.\n\nNezaručuje to však, že súbor nie je v skutočnosti škodlivý a odporúča sa skontrolovať ho nejakým antivírusovým programom.
V poriadku, používatelia programu FDM nehlásili, že je tento preberaný súbor škodlivý
Písmeno jednotky, z ktorej sa FDM spúšťa, napríklad "C:". Vhodné pre prenosnú verziu.
Túto funkciu možno použiť po nainštalovaní zásuvného modulu na konverziu videa.
Ak chcete preberať cez protokol BiTorrent, je potrebné nainštalovať zásuvný modul BitTorrent.
Poznámka: ide o servisné súbory programu Free Download Manager (nie preberané súbory).
Prajete si skopírovať aktuálne súbory údajov do novej zložky (existujúce súbory budú prepísané) ?
Táto zložka bude nastavená ako štandardná zložka na sťahovanie pre všetky skupiny.\nStlačte OK pre pokračovanie
Nastaviť, kde sa budú ukladať sťahované súbory
Zabrániť počítaču prejsť do režimu stand by počas sťahovania
Maximálny počet polootvorených pripojení
Torrenty
Zlyhal prístup k súborom na disku. Overte či disk nie je plný alebo či nie je chránený proti zápisu.
Pomer
Zoznam torrentov
Pridať torrent z webu
Pridať torrent zo súboru
Vytvoriť nový torrent
(automaticky)
Zdroj
Veľkosť dielca
Trackery
Pridať tracker
Odobrať tracker
Spustiť umiestňovanie tohto torrentu
Uložiť
Vytvoriť nový torrent
Súbory torrentov
Priorita
;normal/high priority
preskočiť
normálna
vysoká
Plávajúce okná
Súbory služieb (zoznam stiahnutí, histórie, atď.)
Pôvodné nastavenie miesta sťahovania
Pozastavili ste všetky sťahovania. To znamená, že všetky sťahovania budú sťahované veľmi nízkou rýchlosťou (zvyčajne 1B/s).\nToto umožňuje "pozastaviť" všetky sťahovania, ktoré nepodporujú obnovenie sťahovania.\n\nPre návrat do normálneho stavu spustite tento príkaz znovu alebo reštartujte FDM.
Umiestňovanie
Zapnúť umiestňovanie (doporučené)
Neobmedzené umiestňovanie
Obmedziť podľa pomeru
Umiestňovať dokiaľ nebude pomer
Obmedziť časovo
Umiestňovať behom
Overiť či stiahnutie s podobnou URL už neexistuje
Uložiť históriu sťahovania
Zoznam naposledy stiahnutých súborov
Pôvodné nastavenie pre sťahovanie Bittorrentov
Reštartovať dokončené sťahovanie
Špecifikujte zložku pre prenosnú verziu Firefoxu.
Nedá sa nájsť adresár Apple Safari Plugin. Chcete ho nastaviť manuálne?
Nedá sa nájsť adresár Google Chrome Plugin. Chcete ho nastaviť manuálne?
Nedá sa umiestniť monitorovanie Apple Safari
Nedá sa odstrániť monitorovanie Apple Safari
Nedá sa umiestniť monitorovanie Chrome
Nedá sa odstrániť monitorovanie Google Chrome
Časový limit
;hours, for short
hr.
Limitovať čas kedy FDM bude môcť začať sťahovať
Umožniť spustenie len od
Normálna priorita
Vysoká priorita
Hlavné
Žiadny časový limit pre sťahovanie (dokončenie v bubline)
Skontrolovať, pri novom načítaní dát mirroru, či už neexistuje
Ukázať malé oznamovacie okienko pri dokončených sťahovaniach
Automaticky skryť po
Páči sa Vám FDM? Skúste Personal Informer!
Najnovšia verzia FDM prichádza s bezplatným prídavkom: Personal Informer.
Vloží rýchle linky pre všetky vaše
obľúbené stránky
; next line means --- after you start _browser_. "_browser_" will be Internet Explorer or Firefox
na vašej domácej stránke, aby ste mali prístup hneď po spustení
; \n means next line. don't change this.
Budeme analyzovať vašu históriou prehľadávania a ukážeme vám zoznam\nstránok na webe, ktoré ste navštívili.\nPodľa toho môžeme navrhnúť zoznam podobných stránok,\nktoré by ste chceli navštíviť.
Ste si istí? Celý proces zaberie menej ako 1 minútu a dá Vám naozaj výkonnú domovskú stránku.
Zrušiť nastálo
Pokračovať
Chcete pripomenúť o niekoľko dní?
Názov
Monitorovať sťahovania Flash videa v prehliadačoch
Použitie tejto funkcie môže zapríčiniť konflikty s nejakým iným programom inštalovaným na vašom PC(napr.: RealPlayer). Ak nastanú problémy budete musieť deaktivovať túto funkciu v FDM, alebo riešiť konflikty odstránením konfliktného programu, alebo deaktivovať niektoré jeho funkcie.
Webová stránka
Flash video nájdené na tejto strane
Mali by ste si aktivovať monitorovanie - Flash videa pre sťahovanie. (Možnosti | Nastavenie | Prevzatie | Flash video).
Zadajte URL webovej stránky z ktorej chcete stiahnuť Flash video. Táto stránka musí byť už načítaná vo vašom prehliadači a video by malo hrať.
Vyhľadávanie Flash videa...
Na tejto stránke nebolo nájdené žiadne Flash video. Uistite sa, že video je spustené, alebo skúste znovu načítať (obnoviť stránku, alebo vyčistiť vyrovnávaciu pamäť prehliadača).
; keep "0x%x" as is
Chyba počas pokusu o stiahnutie.\nChyba: 0x%x.
Chyba
Zobraziť tlačidlo "Stiahnuť" 
(len pre Internet Explorer)
Nenašla sa informácia o tejto webovej stránke. Skúste znovu načítať stránku vo vašom prehliadači.
Flash Video
Obmedziť maximálny počet spojení
Toto vypne FDM tipy. Ste si istí?\nTipy môžete zapnúť v Možnostiach | Nastavenie.
Ukázať Tipy
Chyba! Aktualizovaný súbor nie je podpísaný FreeDownloadManager.ORG.
; 
; Also, please download and translate this file:
;  http://freedownloadmanager.org/tips-eng.txt
; Note, that it's UTF-8 encoded file (use Notepad.exe to edit).
;  and do not change text in tags (between "<>", e.g. "<a href...>")
; Send translated file to support@freedownloadmanager.org.
;
;
(len Internet Explorer a Firefox)
Zobraziť tlačítko "Stiahnuť"
Monitorovací modul Flash videa nie je zavedený. Preverte či je spustený FDM a či máte aktivovanú túto voľbu (Možnosti | Nastavenie | Prevzatie | Flash video).
; do not change "0x%x"
Chyba počas pokusu o prenos sťahovania do FDM.\nChyba: 0x%x.
Stiahnuť
Zobraziť toto tlačítko
Nie je žiadne stiahnutie na export.
Tu nie je nič pre export.
"Tichý režim" 
Na zapnutie/vypnutie monitorovania musíte mať administratívne oprávnenie.
Chyba počas pokusu o aktiváciu/deaktiváciu integrácie.
Nedostatočné práva
Na exportovať/importovať nastavenie musíte mať administratívne oprávnenie.
Stiahnuť s FDM
; please keep %d, %s and %% as is
; %d - percents
%d%% stiahnuté spolu
; left to download at... some speed
%s ľavý do stiahnutia pri
Cesta k užívateľskému profilu zložiek.
Import uTorrent sťahovania
uTorrent zložka na uloženie nenájdená!
FDM môže importovať všetky vaše existujúce uTorrent stiahnutia. Chceli by ste importovať?\nMôžete to urobiť kedykoľvek použitím súboru | import | uTorrent sťahovanie.
FDM môže importovať všetky vaše existujúce uTorrent stiahnutia.\nMôžete to urobiť kedykoľvek použitím súboru | Import | Import sťahovanie z iných manažérov.
Import sťahovania z iných manažérov
Orbit Downloader
LeechGet
Nemôžem nájsť cestu k aplikačným informáciám Orbit Downloadera.
Nemôžem detekovať cestu k aplikačným informáciám Orbit Downloadera.
Chyba: %d (%02X)
Diagnostika systému: %s
Nemôžem nájsť servisný súbor Orbit Downloadera, ktorý obsahuje zoznam sťahovania.
Nemôžem čítať zoznam sťahovania Orbit Downloadera.
Nemôžem analyzovať zoznam sťahovania Orbit Downloadera. Zoznam sťahovania má nečakaný formát.
Bol neúspešný pri vytváraní a konfigurovaní %d cesty sťahovania, názov súboru a URL importoval z Orbit Downloadera.
Nedá sa importovať sťahovanie.
V zozname sťahovania Orbit Downloadera nie sú žiadne informácie!
V tomto počítači nie je nainštalovaný Orbit Downloader!
Import sťahovaní z %s bol zastavený kvôli chybe.
Chcete pokračovať v importe z iného manažéra?
Spracované:
Úspešné:
Neúspešné:
Nespracované:
Súhrn:
uTorrent
neurčený
%d z %d
Vyberte manažéri, z ktorých chcete importovať sťahovanie:
FDM môžu importovať stiahnutia z iných manažérov. Chcete importovať?\nMôžete to urobiť kedykoľvek, použitím súboru | import | import sťahovania z iných manažérov.
Detaily: %s
Nemôžem spracovať peer požiadavku.
Závažná chyba pri zavádzaní zoznamu sťahovania.\nKliknite na OK pre pokračovanie (niektoré, alebo všetky sťahovania nebudú uložené), alebo ZRUŠIŤ na ukončenie.\nTento problém môže byť spôsobený nesprávnou inštaláciou - FDM, alebo je poškodený súbor dát.
Neplatná inštalácia: inštalovaný modul Bittorrentu nemôže byť použitý s touto verziou FDM.\nPreinštalujte!\nKliknite na OK pre ukončenie.
; %d - is the number
%d peery prijaté
Také Bittorrent sťahovanie už existuje
Na uplatnenie nastavenia potrebujete administrátorské oprávnenie.
Určiť automaticky
Nastaviť na...
Rýchlosť spojenia
Nastavenia pre prenos dát
% zo spojovacej rýchlosti
Automaticky
; set some setting (maximum number of connections, for example) to some number
Nastaviť na
Súčasná spojovacia rýchlosť je meraná FDM automaticky. Ak máte podozrenie, že hodnoty sú nesprávne, nechajte FDM spustené a uvidíte, či sa vypočítané čísla dostanú bližšie k reálnym hodnotám. Všimnite si, že FDM meria rýchlosť len pri sťahovaní dát. Čím väčší je počet sťahovaní, tým lepšie FDM zistí skutočnú spojovaciu rýchlosť.
Rýchlosť sťahovania
Merať znovu
Určiť hodnotu
Hodnota musí byť väčšia alebo rovná nule.
Uviesť v bitoch, namiesto bajtov
Vytvoriť RTSP, alebo sťahovať MMS
Live Streaming
Nový pokus
Prerušiť všetko
Skúste presunúť súbor:\n %s\n\n do cieľovej zložky pod menom:\n %s\n\n%s: %s\n\nUzatvorte všetky aplikácie, ktoré môžu tento súbor používať.
Unsupported content-encoding
Select all
Reset all
Administrator rights are required to integrate FDM into Internet Explorer. Choosing "Cancel" will integrate it partially.
; %s will be replaced with the actual browser name
Can't delete the browser plugin while %s is running. Please close the browser and click OK to continue.\nClick Cancel to postpone the deletion of the plugin to system reboot.
Can't delete the browser plugin for %s. It will be deleted on system reboot.
Associate with magnet links
Enable Local Peer Discovery
Enable UPnP
Enable NAT-PMP
Enable µTorrent Peer Exchange
Changes will take effect after you restart Free Download Manager
The video you selected has the audio data stream in a separate file.\nIt must be downloaded also for the video to have audio channel.\nThe appropriate audio file has been selected for downloading.\nIt will be automatically merged with the video download as soon as both downloads completes.
The video(s) you selected has the audio data stream in a separate file.\nThis audio download must be downloaded also for the video to have audio channel.\nAre you sure you do not want it to be downloaded?\nChoose Yes to download video file without audio channel.
Waiting for the media merge task to begin
Media merge task succeeded
Media merge task failed
Media merge task has started
Download YouTube video
Video formats found on this page
YouTube video download detected.\nWould you like to download it as YouTube video?
Video monitoring
Video downloads
Additional components required for this feature to work.\nWould you like to download them?
Downloading and installing additional components
Error installing additional components.
A tiny button which helps to download videos from YouTube.com with few clicks.\nIn order to enable this button for other video sites - please enable "Monitor flash downloads in browsers" option.
File size is too large for the target file system.
; %s means browser name; do not remove it
Administrator rights are required to integrate FDM into %s.
Please don't pause this downloads for a long time; otherwise it may need to be restarted.
You have unfinished YouTube downloads. If you stop them now, you might not be able to resume them later. Exit anyway?
If you stop this download for a long time, you might not be able to resume them later. Continue?
Cannot resume download, please restart it manually.
Sequential downloads
New version of flash video monitoring module is available. Would you like to update?
Skip this update
Security check failure
Certificate host name is incorrect
Certificate is expired
Invalid certificate
Security check failed for host
